[
  {
    "id": 1,
    "name": "Hoi An, Vietnam",
    "image": "/Images/vietnamdestination.png",
    "price": "£1,450",
    "rating": 4.7,
    "stars": "★★★★★",
    "description": "Step into a world where time seems to stand still in Hoi An, a UNESCO World Heritage site that enchants visitors with its lantern-lit streets, traditional wooden architecture, and tranquil riverside setting. Once a major trading port during the 15th-19th centuries, this meticulously preserved ancient town seamlessly blends Vietnamese, Chinese, Japanese, and European influences. Colorful lanterns illuminate cobblestone streets at night, while the aroma of delectable street food fills the air. Nearby beaches and verdant rice fields provide a perfect complement to the town's historical charm. The local tailor shops offer bespoke clothing at affordable prices, making for unique souvenirs, while cooking classes reveal the secrets behind Vietnam's celebrated cuisine.",
    "country": "Vietnam",
    "region": "Asia",
    "budget": "budget",
    "flightTime": "~15-17 hours (with connections)",
    "timeZone": "GMT+7",
    "averageAccommodationCost": "£25-60 per night",
    "averageMealCost": "£3-12",
    "localTransportation": "£1-5 per day",
    "visaRequirements": "15-day visa exemption for UK citizens, e-visa available for longer stays",
    "activities": ["culture", "food", "history", "shopping", "photography", "beach"],
    "bestTimeToVisit": "February to April (dry season with moderate temperatures)",
    "language": "Vietnamese",
    "currency": "Vietnamese Dong (VND)",
    "exchangeRate": "~30,000 VND = £1",
    "localCuisine": "Cao lau (noodle dish), White rose dumplings, Banh mi, Fresh spring rolls",
    "travelTips": "Avoid the rainy season (September to November) when flooding is common. Get clothes custom-made by local tailors for an authentic souvenir. £500-700 should cover all in-country expenses for a week excluding accommodation.",
    "accommodationOptions": ["Boutique hotels in restored heritage buildings (£40-80)", "Riverside resorts (£70-150)", "Budget-friendly homestays (£20-35)"],
    "mustSee": ["Japanese Covered Bridge", "Old Town", "Monthly Lantern Festival (full moon nights)", "Cua Dai Beach", "Tra Que Vegetable Village", "Coconut Forest Boat Tour"]
  },
  {
    "id": 2,
    "name": "Bali, Indonesia",
    "image": "/Images/balidestination.png",
    "price": "£1,750",
    "rating": 4.8,
    "stars": "★★★★★",
    "description": "Known as the 'Island of the Gods,' Bali captivates visitors with its perfect blend of spiritual tranquility and vibrant energy. This Indonesian paradise boasts dramatic volcanic landscapes, emerald rice terraces, and palm-fringed beaches with world-class surfing. The island's unique Hindu culture manifests in ornate temples, colorful ceremonies, and traditional dance performances that occur daily across the island. From the cultural heart of Ubud to the trendy beach clubs of Seminyak and the pristine shores of the Bukit Peninsula, Bali offers diverse experiences for every type of traveler, all delivered with the legendary warmth of Balinese hospitality. The island's wellness scene has exploded in recent years, with yoga retreats, meditation centers, and holistic spas catering to those seeking rejuvenation and self-discovery.",
    "country": "Indonesia",
    "region": "Asia",
    "budget": "budget",
    "flightTime": "~16-18 hours (with connections)",
    "timeZone": "GMT+8",
    "averageAccommodationCost": "£30-120 per night",
    "averageMealCost": "£4-15",
    "localTransportation": "£5-15 per day (scooter rental: £5-7)",
    "visaRequirements": "30-day visa-free entry for UK citizens",
    "activities": ["beach", "culture", "adventure", "surfing", "yoga", "temple visits", "hiking", "snorkeling"],
    "bestTimeToVisit": "April to October (dry season with sunny days)",
    "language": "Indonesian, Balinese",
    "currency": "Indonesian Rupiah (IDR)",
    "exchangeRate": "~19,000 IDR = £1",
    "localCuisine": "Babi guling (suckling pig), Nasi campur, Bebek betutu (slow-cooked duck), Fresh seafood",
    "travelTips": "Rent a scooter for flexibility but be cautious in traffic. Always dress modestly when visiting temples (sarongs required). Budget around £600-900 for weekly expenses beyond accommodation.",
    "accommodationOptions": ["Luxury beachfront resorts (£150-500)", "Private villas with pools (£80-300)", "Eco-friendly retreats (£60-150)", "Budget hostels (£10-25)"],
    "mustSee": ["Ubud Monkey Forest", "Tanah Lot Temple", "Mount Batur sunrise trek", "Uluwatu Temple", "Tegallalang Rice Terraces", "Sacred Monkey Forest", "Waterfall circuit in North Bali"]
  },
  {
    "id": 3,
    "name": "Tokyo, Japan",
    "image": "/Images/japandestination.png",
    "price": "£2,600",
    "rating": 4.9,
    "stars": "★★★★★",
    "description": "Tokyo represents the perfect synthesis of ancient tradition and futuristic innovation, where serene Shinto shrines and imperial gardens exist alongside neon-lit skyscrapers and cutting-edge technology. This sprawling metropolis comprises distinct neighborhoods, each with its own character—from the fashion-forward streets of Harajuku to the electronic wonderland of Akihabara and the upscale boutiques of Ginza. Home to the world's finest dining scene with more Michelin-starred restaurants than any other city, Tokyo offers culinary experiences ranging from humble ramen shops to exquisite kaiseki establishments. Remarkably efficient public transportation connects this vast urban landscape, making it surprisingly navigable despite its size and complexity. The city's devotion to excellence extends to every aspect of life, from precision-crafted cocktails in tiny bars to the meticulous presentation of department store goods. Tokyo constantly reinvents itself while honoring its past, creating an intoxicating blend of experiences unlike anywhere else on earth.",
    "country": "Japan",
    "region": "Asia",
    "budget": "luxury",
    "flightTime": "~11-13 hours (direct)",
    "timeZone": "GMT+9",
    "averageAccommodationCost": "£100-300 per night",
    "averageMealCost": "£8-50",
    "localTransportation": "£6-12 per day (metro day pass: £6)",
    "visaRequirements": "Visa-free for UK citizens (up to 90 days)",
    "activities": ["culture", "food", "technology", "shopping", "nightlife", "gardens", "museums", "anime"],
    "bestTimeToVisit": "March to May (cherry blossoms) or September to November (autumn colors)",
    "language": "Japanese",
    "currency": "Japanese Yen (JPY)",
    "exchangeRate": "~190 JPY = £1",
    "localCuisine": "Sushi, Ramen, Tempura, Yakitori, Wagyu beef, Matcha desserts",
    "travelTips": "Purchase a Suica/Pasmo card for seamless transit. Business hours for attractions often begin at 10am. Most restaurants specialize in one type of cuisine. Budget £1,000-1,500 for a week of expenses beyond accommodation.",
    "accommodationOptions": ["Traditional ryokans (£150-350)", "Capsule hotels (£25-60)", "Luxury high-rise hotels (£200-800)", "Business hotels (£80-150)"],
    "mustSee": ["Shibuya Crossing", "Tokyo Skytree", "Meiji Shrine", "Shinjuku Gyoen National Garden", "Tsukiji Outer Market", "Senso-ji Temple", "TeamLab Borderless Digital Art Museum", "Toyosu Fish Market"]
  },
  {
    "id": 4,
    "name": "Santorini, Greece",
    "image": "/Images/greecedestination.png",
    "price": "£2,200",
    "rating": 4.8,
    "stars": "★★★★★",
    "description": "Rising dramatically from the Aegean Sea, Santorini stands as one of the world's most instantly recognizable destinations with its whitewashed, cubiform buildings cascading down volcanic cliffs. Created by one of history's largest volcanic eruptions, this crescent-shaped island embraces a sea-filled caldera, offering some of the Mediterranean's most spectacular vistas, particularly at sunset when the sea and sky ignite in brilliant hues of orange and pink. Beyond the iconic villages of Oia and Fira with their blue-domed churches, visitors discover black and red sand beaches, ancient ruins dating back to the Minoan civilization, family-run wineries producing distinctive vintages from grapes grown in volcanic soil, and a burgeoning culinary scene that celebrates fresh Mediterranean ingredients. The island's unique architecture features cave houses carved into the volcanic rock, many now transformed into luxurious accommodations with infinity pools overlooking the caldera. Santorini's beauty extends beyond surface charm, revealing layers of geological wonder, archaeological significance, and cultural richness for those willing to explore beyond the famous sunset spots.",
    "country": "Greece",
    "region": "Europe",
    "budget": "moderate",
    "flightTime": "~4 hours (direct) or ~7 hours (with connections)",
    "timeZone": "GMT+3",
    "averageAccommodationCost": "£150-400 per night (caldera view), £70-150 (non-caldera)",
    "averageMealCost": "£15-40",
    "localTransportation": "£15-25 per day (car/ATV rental: £30-50)",
    "visaRequirements": "No visa required for UK citizens",
    "activities": ["beach", "culture", "food", "wine tasting", "sailing", "photography", "hiking"],
    "bestTimeToVisit": "April to June or September to October (avoiding summer crowds)",
    "language": "Greek",
    "currency": "Euro (EUR)",
    "exchangeRate": "~1.15 EUR = £1",
    "localCuisine": "Fava (yellow split pea puree), Tomatokeftedes (tomato fritters), Saganaki, Fresh seafood, Local wines",
    "travelTips": "Book accommodations with caldera views well in advance. Consider visiting in shoulder season for better prices and fewer crowds. Budget £800-1,200 for a week of expenses beyond accommodation.",
    "accommodationOptions": ["Cave hotels carved into the cliffside (£200-800)", "Luxury villas with infinity pools (£300-1,000)", "Boutique guesthouses (£100-250)", "Budget apartments away from caldera (£50-100)"],
    "mustSee": ["Oia Village sunset views", "Red Beach", "Ancient Thera", "Akrotiri Archaeological Site", "Caldera sailing cruise", "Santo Wines winery", "Amoudi Bay", "Three Bells of Fira"]
  },
  {
    "id": 5,
    "name": "Edinburgh, Scotland",
    "image": "/Images/scotlanddestination.png",
    "price": "£850",
    "rating": 4.7,
    "stars": "★★★★★",
    "description": "Edinburgh seamlessly blends medieval history with Georgian elegance, creating one of Europe's most atmospheric and visually stunning cities. Dominated by its imposing castle perched atop an extinct volcano, the Scottish capital features two distinct areas: the medieval Old Town with its Royal Mile and narrow closes (alleyways), and the neoclassical New Town with its geometric streets and grand squares—together comprising a UNESCO World Heritage site. Beyond its architectural splendor, Edinburgh thrives as a cultural powerhouse, hosting the world's largest arts festival each August and nurturing a vibrant literary tradition that earned it UNESCO City of Literature status. The city's mystical atmosphere, enhanced by swirling mists and gothic spires, has inspired countless writers from Robert Louis Stevenson to J.K. Rowling, while numerous pubs and restaurants offer opportunities to sample Scotch whisky and contemporary Scottish cuisine. Beneath the city streets lies a hidden world of underground vaults and forgotten streets, adding another layer to Edinburgh's multifaceted character. Just beyond the city limits, the dramatic Scottish countryside beckons with rolling hills, mysterious lochs, and ancient castles.",
    "country": "Scotland",
    "region": "Europe",
    "budget": "moderate",
    "flightTime": "~1-1.5 hours from London, 4-5 hours by train",
    "timeZone": "GMT",
    "averageAccommodationCost": "£90-250 per night",
    "averageMealCost": "£12-35",
    "localTransportation": "£4-10 per day (day ticket: £4.50)",
    "visaRequirements": "No visa required for UK citizens",
    "activities": ["history", "culture", "food", "whisky tasting", "hiking", "literature", "ghost tours", "festivals"],
    "bestTimeToVisit": "June to August (festival season) or December (Christmas markets and Hogmanay)",
    "language": "English, Scots",
    "currency": "Pound Sterling (GBP)",
    "localCuisine": "Haggis with neeps and tatties, Cullen skink, Scottish salmon, Cranachan, Shortbread",
    "travelTips": "Book accommodations far in advance during the August festivals (prices can triple). Edinburgh is very walkable but wear comfortable shoes for the hills and cobblestones. Budget £600-900 for a week of expenses beyond accommodation.",
    "accommodationOptions": ["Historic hotels in Old Town (£150-350)", "Georgian townhouse apartments (£120-300)", "Boutique B&Bs (£80-150)", "Modern hotels in New Town (£100-250)"],
    "mustSee": ["Edinburgh Castle", "Royal Mile", "Arthur's Seat", "Edinburgh Festival Fringe", "Holyrood Palace", "Royal Yacht Britannia", "National Museum of Scotland", "Camera Obscura", "The Real Mary King's Close"]
  },
  {
    "id": 6,
    "name": "New York City, United States",
    "image": "/Images/americadestination.png",
    "price": "£2,850",
    "rating": 4.9,
    "stars": "★★★★★",
    "description": "The quintessential metropolis that never sleeps, New York City pulses with an energy that's impossible to replicate. This global crossroads comprises five distinctive boroughs, each with its own character—from the skyscraper canyons of Manhattan to the cultural melting pot of Queens, the historic brownstones of Brooklyn, the Yankee Stadium in the Bronx, and the unexpected green spaces of Staten Island. A world capital of art, fashion, theater, cuisine, and finance, NYC offers unparalleled cultural experiences with over 100 museums, the bright lights of Broadway, and dining options spanning humble street food to world-class restaurants helmed by celebrity chefs. Central Park provides an 843-acre green oasis amid the urban landscape, while iconic landmarks from the Statue of Liberty to the Empire State Building create the world's most recognizable skyline. With each neighborhood offering distinct experiences—SoHo's upscale shopping, the artistic energy of Chelsea, the multicultural vibrancy of Jackson Heights—New York rewards both first-time visitors and lifelong residents with endless discoveries. The city's round-the-clock subway system connects these diverse experiences, making it possible to have breakfast in a classic Jewish deli, lunch in Little Italy, and dinner in Koreatown, with world-class shopping, cultural attractions, and people-watching in between.",
    "country": "United States",
    "region": "North America",
    "budget": "luxury",
    "flightTime": "~7-8 hours (direct)",
    "timeZone": "GMT-5",
    "averageAccommodationCost": "£200-500 per night",
    "averageMealCost": "£15-60",
    "localTransportation": "£15-25 per day (7-day MetroCard: £35)",
    "visaRequirements": "ESTA (Electronic System for Travel Authorization) required",
    "activities": ["culture", "food", "history", "shopping", "theater", "museums", "architecture", "nightlife"],
    "bestTimeToVisit": "April to June or September to November (pleasant temperatures and fewer tourists)",
    "language": "English",
    "currency": "US Dollar (USD)",
    "exchangeRate": "~1.27 USD = £1",
    "localCuisine": "New York-style pizza, Bagels with lox, Pastrami sandwiches, Cheesecake, International cuisines from around the world",
    "travelTips": "Purchase a MetroCard for unlimited subway and bus rides. Walk where possible to experience neighborhood character. Don't look up too much (signals tourist status). Budget £1,200-1,800 for a week of expenses beyond accommodation.",
    "accommodationOptions": ["Luxury hotels on 5th Avenue (£350-1,000)", "Boutique hotels in SoHo (£250-600)", "Apartment rentals in Brooklyn (£150-350)", "Budget hotels near transit hubs (£120-200)"],
    "mustSee": ["Times Square", "Central Park", "Statue of Liberty", "Brooklyn Bridge", "Metropolitan Museum of Art", "The High Line", "Empire State Building", "Grand Central Terminal", "9/11 Memorial and Museum", "Museum of Modern Art (MoMA)", "Greenwich Village", "Williamsburg, Brooklyn"]
  },
  {
    "id": 7,
    "name": "Machu Picchu, Peru",
    "image": "/Images/machupichudestination.png",
    "price": "£2,600",
    "rating": 4.9,
    "stars": "★★★★★",
    "description": "Perched dramatically among misty Andean peaks at 2,430 meters above sea level, Machu Picchu stands as the most spectacular legacy of the Inca civilization and one of humanity's most extraordinary architectural achievements. This 15th-century citadel remained hidden from the outside world until 1911, when archaeologist Hiram Bingham introduced it to modern audiences, igniting global fascination that continues unabated. The site's perfectly fitted stone constructions—built without mortar and aligned with astronomical events—demonstrate the Incas' architectural sophistication and spiritual connection to the natural world. Visitors can explore temples, plazas, residential areas, and elaborate terracing systems set against the backdrop of Huayna Picchu mountain and surrounded by verdant cloud forests teeming with unique flora and fauna. The journey to this UNESCO World Heritage site is as memorable as the destination itself, whether approaching via the legendary Inca Trail with its challenging mountain passes and ancient stone paths, or by train through the breathtaking Sacred Valley. Each year, the rising sun of the winter solstice aligns perfectly with the main buildings, illuminating the mystical significance of this mountaintop sanctuary that continues to inspire wonder and reverence.",
    "country": "Peru",
    "region": "South America",
    "budget": "moderate",
    "flightTime": "~12-15 hours (with connections to Lima, then domestic flight to Cusco)",
    "timeZone": "GMT-5",
    "averageAccommodationCost": "£80-250 per night (in Aguas Calientes/Cusco)",
    "averageMealCost": "£10-30",
    "localTransportation": "£15-40 per day (including trains and buses to site)",
    "visaRequirements": "No visa required for UK citizens (stays up to 183 days)",
    "activities": ["hiking", "history", "adventure", "archaeology", "nature", "photography"],
    "bestTimeToVisit": "May to October (dry season with clearer views)",
    "language": "Spanish, Quechua",
    "currency": "Peruvian Sol (PEN)",
    "exchangeRate": "~4.7 PEN = £1",
    "localCuisine": "Lomo saltado, Ceviche, Alpaca steak, Causa, Pisco sour (cocktail)",
    "travelTips": "Spend 2-3 days in Cusco first to acclimatize to the altitude. Book Machu Picchu tickets and Inca Trail permits months in advance. Budget £800-1,200 for a week of expenses beyond accommodation. Bring layers as weather can change quickly.",
    "accommodationOptions": ["Luxury lodges in Sacred Valley (£200-500)", "Mid-range hotels in Aguas Calientes (£80-150)", "Historic boutique hotels in Cusco (£100-250)", "Budget hostels (£20-40)"],
    "mustSee": ["Inca Trail", "Sun Gate (Intipunku)", "Huayna Picchu hike", "Sacred Valley", "Temple of the Sun", "Agricultural Terraces", "Cusco's historic center", "Ollantaytambo fortress"]
  },
  {
    "id": 8,
    "name": "Sydney, Australia",
    "image": "/Images/australiadestination.png",
    "price": "£3,100",
    "rating": 4.8,
    "stars": "★★★★★",
    "description": "Sydney harmoniously combines urban sophistication with laid-back beach culture, all set against the backdrop of one of the world's most spectacular harbors. The city's iconic skyline—dominated by the sail-shaped Opera House and the impressive Harbour Bridge—creates an unforgettable first impression, while its 100+ beaches, including world-famous Bondi and tranquil Manly, offer endless opportunities for coastal recreation and relaxation. Beyond these postcard-perfect scenes, Sydney reveals itself as a diverse multicultural hub with distinct neighborhoods showcasing influences from across the globe, from the aromatic restaurants of Chinatown to the Italian cafés of Leichhardt. The city embraces the outdoors with an extensive network of coastal walks, harbor ferries, and lush gardens, while its thriving cultural scene encompasses world-class museums, innovative theaters, and a dynamic food landscape that celebrates Australia's exceptional produce and multicultural heritage. Just beyond the city limits lie the rugged Blue Mountains, the vineyards of the Hunter Valley, and the pristine beaches of the Central Coast, making Sydney an ideal base for exploring the natural wonders of New South Wales. The city's enviable climate allows for year-round enjoyment of its outdoor lifestyle, whether joining locals for a sunrise swim, picnicking in the Royal Botanic Garden, or watching the sunset from a harbor-side bar.",
    "country": "Australia",
    "region": "Oceania",
    "budget": "luxury",
    "flightTime": "~22-24 hours (with connections)",
    "timeZone": "GMT+11 (GMT+10 in winter)",
    "averageAccommodationCost": "£130-350 per night",
    "averageMealCost": "£15-45",
    "localTransportation": "£8-20 per day (Opal card for public transit)",
    "visaRequirements": "eVisitor visa required for UK citizens (free)",
    "activities": ["beach", "culture", "adventure", "wildlife", "sailing", "food", "hiking", "surfing"],
    "bestTimeToVisit": "September to November or March to May (mild temperatures and fewer tourists)",
    "language": "English",
    "currency": "Australian Dollar (AUD)",
    "exchangeRate": "~1.9 AUD = £1",
    "localCuisine": "Fresh seafood, Modern Australian fusion, Asian-Pacific cuisine, Tim Tams, Flat white coffee",
    "travelTips": "Apply sunscreen generously even on cloudy days. Sydney is spread out, so plan daily activities by area. Budget £900-1,500 for a week of expenses beyond accommodation.",
    "accommodationOptions": ["Harbour view luxury hotels (£250-800)", "Beachside boutique hotels (£150-350)", "Serviced apartments (£120-300)", "Backpacker hostels (£25-50)"],
    "mustSee": ["Sydney Opera House", "Bondi Beach", "Sydney Harbour Bridge", "Royal Botanic Garden", "Taronga Zoo", "The Rocks historic district", "Darling Harbour", "Coastal walk from Bondi to Coogee", "Blue Mountains (day trip)"]
  },
  {
    "id": 9,
    "name": "Barcelona, Spain",
    "image": "/Images/spaindestination.png",
    "price": "£1,350",
    "rating": 4.8,
    "stars": "★★★★★",
    "description": "Barcelona captivates visitors with its unique blend of Mediterranean charm, avant-garde creativity, and architectural wonders. The city serves as an open-air museum showcasing Antoni Gaudí's fantastical masterpieces, from the undulating façades of Casa Batlló to the soaring spires of the still-unfinished Sagrada Família basilica, which has been under construction for over 140 years. Beyond Gaudí's genius, Barcelona's distinct neighborhoods offer immersive experiences—the labyrinthine medieval streets of the Gothic Quarter contrast with the grid-like precision of the modernist Eixample district, while the revitalized waterfront connects the city to the Mediterranean Sea. Culinary adventures await at every turn, from the sensory explosion of La Boqueria market to traditional tapas bars and innovative Catalan restaurants helmed by world-renowned chefs. Barcelona's creative spirit extends to its vibrant arts scene, with museums dedicated to native sons Picasso and Miró, while street performers and musicians enliven public spaces like the tree-lined Las Ramblas promenade. The city's famous football club, FC Barcelona, inspires near-religious devotion, with matches at Camp Nou stadium providing an electrifying glimpse into local passion. With its perfect combination of cultural riches, architectural treasures, culinary delights, and laid-back beach life, Barcelona offers a multifaceted urban experience that visitors find irresistibly compelling.",
    "country": "Spain",
    "region": "Europe",
    "budget": "moderate",
    "flightTime": "~2-2.5 hours (direct)",
    "timeZone": "GMT+1",
    "averageAccommodationCost": "£100-250 per night",
    "averageMealCost": "£12-35",
    "localTransportation": "£7-15 per day (T-10 ticket: £11)",
    "visaRequirements": "No visa required for UK citizens",
    "activities": ["culture", "food", "beach", "architecture", "art", "nightlife", "shopping", "football"],
    "bestTimeToVisit": "May to June or September to October (pleasant weather and fewer crowds)",
    "language": "Spanish, Catalan",
    "currency": "Euro (EUR)",
    "exchangeRate": "~1.15 EUR = £1",
    "localCuisine": "Paella, Tapas, Bombas, Crema Catalana, Seafood, Catalan wines and cava",
    "travelTips": "Be vigilant about pickpockets in tourist areas. Many restaurants don't open for dinner until 8-9pm. Budget £700-1,000 for a week of expenses beyond accommodation.",
    "accommodationOptions": ["Luxury beachfront hotels (£200-500)", "Boutique hotels in Gothic Quarter (£120-250)", "Modern apartments in Eixample (£90-200)", "Hostels with private rooms (£50-80)"],
    "mustSee": ["Sagrada Família", "Park Güell", "Gothic Quarter", "La Rambla", "Casa Batlló", "La Pedrera (Casa Milà)", "Barceloneta Beach", "Picasso Museum", "Camp Nou", "Montjuïc"]
  },
  {
    "id": 10,
    "name": "Bangkok, Thailand",
    "image": "/Images/thailanddestination.png",
    "price": "£1,500",
    "rating": 4.6,
    "stars": "★★★★☆",
    "description": "Bangkok embodies captivating contradictions—a metropolis where gleaming skyscrapers tower over ancient temples, luxury malls stand beside bustling street markets, and high-speed boats navigate centuries-old canals. Thailand's vibrant capital assaults the senses in the most exhilarating way, with the fragrance of street food mingling with incense from ornate shrines, the constant hum of tuk-tuks punctuated by chanting monks, and visual splendor ranging from gilt-covered temple spires to neon-lit nightlife districts. The city's sacred sites include the magnificent Grand Palace complex, home to Thailand's most revered Buddha image, and Wat Arun, the Temple of Dawn, whose porcelain-encrusted spires shimmer beside the Chao Phraya River. Bangkok's food scene spans humble street stalls earning Michelin recognition to sophisticated restaurants reimagining Thai classics, all united by bold flavors and meticulous preparation. Residents embrace a distinctive blend of traditional values and cosmopolitan outlook, creating a welcoming atmosphere despite the urban intensity. While navigating the city's notorious traffic requires patience, efficient public transit options include the elevated BTS Skytrain, underground MRT, and river taxis. Hidden among the concrete corridors lie peaceful parks, local neighborhoods, and floating markets that provide respite from urban energy while revealing authentic glimpses of Thai culture beyond tourist highlights.",
    "country": "Thailand",
    "region": "Asia",
    "budget": "budget",
    "flightTime": "~11-13 hours (direct)",
    "timeZone": "GMT+7",
    "averageAccommodationCost": "£40-150 per night",
    "averageMealCost": "£3-20",
    "localTransportation": "£5-12 per day",
    "visaRequirements": "30-day visa exemption for UK citizens",
    "activities": ["culture", "food", "history", "shopping", "temples", "nightlife", "markets", "river cruises"],
    "bestTimeToVisit": "November to March (cooler, drier season)",
    "language": "Thai",
    "currency": "Thai Baht (THB)",
    "exchangeRate": "~45 THB = £1",
    "localCuisine": "Pad Thai, Tom Yum Goong, Green Curry, Mango Sticky Rice, Street food varieties",
    "travelTips": "Dress modestly when visiting temples (shoulders and knees covered). Use metered taxis or ride-hailing apps rather than accepting flat rates. Budget £500-800 for a week of expenses beyond accommodation.",
    "accommodationOptions": ["Luxury riverside hotels (£150-400)", "Modern mid-range hotels (£60-120)", "Boutique guesthouses (£40-80)", "Budget hostels (£10-30)"],
    "mustSee": ["Grand Palace", "Wat Arun", "Chatuchak Weekend Market", "Khao San Road", "Jim Thompson House", "Wat Pho (Reclining Buddha)", "Chao Phraya River cruise", "Chinatown (Yaowarat)", "Asiatique Riverfront"]
  },
  {
    "id": 11,
    "name": "Costa Rica",
    "image": "/Images/costaricadestination.png",
    "price": "£2,200",
    "rating": 4.7,
    "stars": "★★★★★",
    "description": "Costa Rica embodies its national motto of 'Pura Vida' (pure life) through its extraordinary biodiversity, enlightened conservation practices, and relaxed way of life that has earned it recognition as one of the world's happiest countries. This compact Central American nation packs astonishing ecological variety into its borders—misty cloud forests where quetzals fly among orchid-draped trees, tropical dry forests harboring howler monkeys and sloths, pristine Caribbean and Pacific beaches where sea turtles nest, and active volcanoes rising from lush rainforests. Adventure opportunities abound, from world-class surfing and white-water rafting to zip-lining through forest canopies and hiking remote wilderness trails. Having abolished its military in 1949, Costa Rica redirected resources toward education and healthcare, creating a peaceful democracy with a strong commitment to sustainability—approximately 30% of its territory is protected in national parks and reserves. Visitors discover that environmental consciousness extends from sophisticated ecolodges to small family farms practicing sustainable agriculture. The country's rich biodiversity includes over 500,000 species (nearly 4% of all species estimated to exist worldwide), making wildlife encounters almost inevitable even for casual observers.",
    "country": "Costa Rica",
    "region": "Central America",
    "budget": "moderate",
    "flightTime": "~11-13 hours (with connections)",
    "timeZone": "GMT-6",
    "averageAccommodationCost": "£80-250 per night",
    "averageMealCost": "£10-30",
    "localTransportation": "£30-50 per day (car rental recommended)",
    "visaRequirements": "No visa required for UK citizens (up to 90 days)",
    "activities": ["adventure", "wildlife", "hiking", "beach", "surfing", "ecotourism", "volcano tours", "birdwatching"],
    "bestTimeToVisit": "December to April (dry season)",
    "language": "Spanish",
    "currency": "Costa Rican Colón (CRC)",
    "exchangeRate": "~680 CRC = £1",
    "localCuisine": "Gallo pinto (rice and beans), Casado, Ceviche, Plantains, Fresh tropical fruits",
    "travelTips": "Roads can be challenging; consider hiring a driver for certain routes. Book popular ecolodges months in advance. Budget £800-1,200 for a week of expenses beyond accommodation.",
    "accommodationOptions": ["Luxury ecolodges (£200-600)", "Mid-range hotels and resorts (£100-200)", "Budget-friendly cabinas (£50-90)", "Hostels (£15-40)"],
    "mustSee": ["Arenal Volcano", "Manuel Antonio National Park", "Monteverde Cloud Forest", "Tortuguero National Park", "Tamarindo Beach", "Corcovado National Park", "La Fortuna Waterfall", "Hanging Bridges"]
  },
  {
    "id": 12,
    "name": "Marrakech, Morocco",
    "image": "/Images/moroccodestination.png",
    "price": "£1,300",
    "rating": 4.6,
    "stars": "★★★★☆",
    "description": "Marrakech enthralls visitors with its intoxicating blend of ancient traditions and contemporary energy, all set against the dramatic backdrop of the Atlas Mountains. The city's beating heart is Jemaa el-Fnaa square, which transforms throughout the day from a marketplace into an open-air theater where storytellers, musicians, acrobats, and food vendors create an unforgettable sensory spectacle. Beyond this famous plaza lies the medina—a UNESCO-protected labyrinth of narrow alleys housing souks selling everything from handwoven carpets and hammered metalwork to aromatic spices and delicate ceramics. Behind the high walls of the old city, peaceful riads (traditional houses with interior courtyards) have been converted into intimate guesthouses where visitors can experience Moroccan hospitality amid mosaic tiles, carved cedar, and the gentle splash of fountains. The city's architectural treasures include the ornate 19th-century Bahia Palace, the ancient Ben Youssef Madrasa theological college, and the distinctive minaret of Koutoubia Mosque, while the vibrant blue gardens of Majorelle provide a tranquil contrast to urban intensity. Just beyond the city limits, palm groves and desert landscapes offer opportunities for camel rides, balloon flights, and excursions to Berber villages. Marrakech's culinary scene ranges from street food vendors serving delicious tagines to sophisticated restaurants reimagining Moroccan flavors, all reflective of the country's position at the crossroads of Arab, African, and Mediterranean influences.",
    "country": "Morocco",
    "region": "Africa",
    "budget": "budget",
    "flightTime": "~3.5-4 hours (direct)",
    "timeZone": "GMT+1",
    "averageAccommodationCost": "£70-200 per night",
    "averageMealCost": "£8-25",
    "localTransportation": "£5-15 per day",
    "visaRequirements": "No visa required for UK citizens",
    "activities": ["culture", "food", "history", "shopping", "hammam spas", "photography", "desert excursions", "architecture"],
    "bestTimeToVisit": "March to May or September to November (moderate temperatures)",
    "language": "Arabic, Berber, French",
    "currency": "Moroccan Dirham (MAD)",
    "exchangeRate": "~12.5 MAD = £1",
    "localCuisine": "Tagine, Couscous, Pastilla, Mint tea, Moroccan breads and pastries",
    "travelTips": "Haggling is expected in souks—start at 40% of asking price. Dress modestly out of respect for local culture. Budget £600-900 for a week of expenses beyond accommodation.",
    "accommodationOptions": ["Luxury riads in the medina (£150-400)", "Boutique hotels (£100-250)", "Traditional guesthouses (£60-120)", "Budget hostels (£15-30)"],
    "mustSee": ["Jemaa el-Fnaa", "Bahia Palace", "Majorelle Garden", "Koutoubia Mosque", "The souks", "Ben Youssef Madrasa", "Saadian Tombs", "Day trip to Atlas Mountains", "El Badi Palace"]
  }
]